Javascript Allonge Notepad

***** Ex:
  #+BEGIN_SRC js
    return () => 0
  #+END_SRC

  #+RESULTS:
  | Function |

***** Ex:
  #+BEGIN_SRC js
    return (() => 0 )()
  #+END_SRC

  #+RESULTS:
  : 0

***** Ex:
 #+BEGIN_SRC js
   return () => {2 + 2}
 #+END_SRC

 #+RESULTS:
 | Function |

***** Ex:
 #+BEGIN_SRC js
  return (() => { return 2+2; })()  
 #+END_SRC

 #+RESULTS:
 : 4

***** Ex:

#+BEGIN_SRC js
  return ((x) => (y) => x)(1)(2)
#+END_SRC

#+RESULTS:
: 1

***** ex: 
#+BEGIN_SRC js
  return ((pi) => (diameter) => diameter * pi)(3.14)(10)
#+END_SRC

#+RESULTS:
: 31.400000000000002

***** Ex:
#+BEGIN_SRC js
  return ((diameter) => ((pi) => diameter * pi)(3.14))(10)
#+END_SRC

#+RESULTS:
: 31.400000000000002

*** Example:

#+BEGIN_SRC js cmd: "org-babel-node --presets es2015" :results output
const callFirst = (fn, larg) =>
  function (rest) {
  return fn.call(this, larg, rest);
};

const greet = (me, you) =>
  `Hello, ${you}, my name is ${me}`;
 
const heliosSaysHello = callFirst(greet, 'Helios');

console.log(heliosSaysHello('Celine'));

#+END_SRC

#+RESULTS:
: Hello, Celine, my name is Helios

*** Example:

#+BEGIN_SRC js
const unary = (fn) =>
   fn.length === 1
     ? fn
     : function (something) {
         return fn.call(this, something);
};
console.log(['1', '2', '3'].map(unary(parseInt)));
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |

*** Application Example:

#+BEGIN_SRC js
const tap = (value) =>
 (fn) => (
   typeof(fn) === 'function' && fn(value),
     value
   );

tap('espresso')(it => {
  console.log(`Our drink is '${it}'`);
});
#+END_SRC

#+RESULTS:
: Out drink is 'espresso'
: undefined

*** Example:

#+BEGIN_SRC js
'use strict'
const once = (fn) => {
  let done = false;
 
  return function () {
    return done ? void 0 : ((done = true), fn.apply(this, arguments))
  }
};

const askedOnABlindDate = once(
  () => 'sure'
);

console.log(askedOnABlindDate());
console.log(askedOnABlindDate());
console.log(askedOnABlindDate());
console.log(askedOnABlindDate());

#+END_SRC

#+RESULTS:
: sure
: undefined
: undefined
: undefined
: undefined

*** Example:
    
#+BEGIN_SRC js
const leftVariadic = (fn) => {
  if (fn.length < 1) {
    return fn;
  } else {
    return function (args) {
      const gathered = args.slice(0, args.length - fn.length + 1), spread = args.slice(args.length - fn.length + 1);
      return fn.apply(
        this, [gathered].concat(spread)
      ); }
    } 
};

const butLastAndLast = leftVariadic((butLast, last) => [butLast, last]);
console.log(butLastAndLast(['why', 'hello', 'there', 'little', 'droid']));
#+END_SRC

#+RESULTS:
| (why hello there little) | droid |

**** Recipe:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
'use strict'
const [first, ...butFirst] = ['why', 'hello', 'there', 'little', 'droid'];
console.log(butFirst);
console.log(first); 
#+END_SRC

#+RESULTS:
: [ 'hello', 'there', 'little', 'droid' ]
: why

**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
const leftGather = (outputArrayLength) => { 
  return function (inputArray) {
    return [inputArray.slice(0, 
            inputArray.length - outputArrayLength + 1)]
           .concat(
             inputArray.slice(inputArray.length - outputArrayLength + 1)
           )
    } 
};

const [butLast, last] = leftGather(2)(['why', 'hello', 'there', 'little', 'droid']);
console.log(butLast);
console.log(last);

#+END_SRC  

#+RESULTS:
: [ 'why', 'hello', 'there', 'little' ]
: droid

     
*** Example:
 
#+BEGIN_SRC js
  const compose = (a, b) =>
    (c) => a(b(c))

  const addOne = (number) => number + 1;
  const doubleOf = (number) => number * 2;
  const doubleOfAddOne = compose(doubleOf, addOne);

  console.log(doubleOfAddOne(3));

#+END_SRC

#+RESULTS:
: 8
: undefined

*** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" 
  const pipeline = (...fns) => 
    (value) =>
      fns.reduce((acc, fn) => fn(acc), value); 

  const addOne = (number) => number + 1;
  const double = (number) => number * 2;
  const setter = pipeline(addOne, double);

console.log(setter(2));
#+END_SRC

#+RESULTS:
: 6
: undefined


***** Example:

#+BEGIN_SRC js
  const x = [], a = [x];
  console.log(a[0] === x);

#+END_SRC

#+RESULTS:
: true
: undefined

**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"
// declare
  const container = ['goodies'];
// destructure
  const unwrap = (wrapped) => { 
    const [something] = wrapped;
    return something; 
  }
  console.log(unwrap(container));

#+END_SRC

#+RESULTS:
: goodies
: undefined

**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const [car, ...cdr] = [1, 2, 3, 4, 5];
  console.log(car);
  console.log(cdr);
#+END_SRC

#+RESULTS:
: 1
: [ 2, 3, 4, 5 ]
**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"
  const oneTwoThree = ['one', 'two', 'three'];
  console.log(['zero', ...oneTwoThree]);

#+END_SRC

#+RESULTS:
| zero | one | two | three |

***** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"
  const [thistle, that, theOther] = ['duck feet', 'tiger tail'];
  console.log(theOther);

  const [...what] = [];
  console.log(what);

#+END_SRC

#+RESULTS:
: undefined
: []
: undefined

***** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const description = (nameAndOccupation) => { 
    if (nameAndOccupation.length < 2) {
      return ["", "occupation missing"] 
    } else {
      const [[first, last], occupation] = nameAndOccupation;
      return [`${first} is a ${occupation}`, "ok"];
    }
  }

  const [reg, status] = description([["Reginald", "Braithwaite"], "programmer"]);

  console.log(reg);
  console.log(status);
#+END_SRC

#+RESULTS:
: Reginald is a programmer
: ok

***** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
 const theWholeShebang = (car, ...cdr) => [car, cdr];
 console.log(theWholeShebang('why', 'hello', 'there', 'little', 'droid'));

#+END_SRC

#+RESULTS:
: [ 'why', [ 'hello', 'there', 'little', 'droid' ] ]


*** A process to determing whether a value is an empty list:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const isEmpty = ([first, ...rest]) => first === undefined; 

  console.log(isEmpty([]));
  console.log(isEmpty([0]));
  console.log(isEmpty([[]]));

#+END_SRC

#+RESULTS:
: true
: false
: false

*** A recursive process to determine the length of an array

 #+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

   const length = ([first, ...rest]) =>
     first === undefined 
       ? 0
       : 1 + length(rest);

   console.log(length([]));
   console.log(length([1,2,3]));

 #+END_SRC

 #+RESULTS:
 : 0
 : 3
*** Flatten-ing

#+BEGIN_SRC  js :cmd "org-babel-node --presets es2015" :results output

  const flatten = ([first, ...rest]) => {
    if (first === undefined) {
      return [];
    } else if (!Array.isArray(first)) {
      return [first, ...flatten(rest)];
    } else {
      return [...flatten(first), ...flatten(rest)];
    }
}

console.log(flatten(['foo', [3, 4, []]]));

#+END_SRC

#+RESULTS:
: [ 'foo', 3, 4 ]

**** sumSquares Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const sumSquares = ([first, ...rest]) => 
    first === undefined 
      ? 0
      : first * first + sumSquares(rest);

  console.log(sumSquares([1,2,3]));

#+END_SRC

#+RESULTS:
: 14

**** foldWith, a moar general mapWith:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const foldWith = (fn, terminalValue, [first, ...rest]) => 
    first === undefined
      ? terminalValue
      : fn(first, foldWith(fn, terminalValue, rest));

  console.log(foldWith((x, rest) => x * x + rest, 0, [1,2,3]));

#+END_SRC

#+RESULTS:
: 14

**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const foldWith = (fn, terminalValue, [first, ...rest]) => 
    first === undefined
      ? terminalValue
      : fn(first, foldWith(fn, terminalValue, rest));

  const mapWith = (fn, array) => 
    foldWith((first, rest) => [fn(first), ...rest], [], array);

  const squareAll = (array) => mapWith((x) => x * x, array);

  console.log(squareAll([1,2,3,4,5]));

#+END_SRC

#+RESULTS:
: [ 1, 4, 9, 16, 25 ]

  
**** Length Example:
    
#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"


  const lengthTCO = ([first, ...rest], counter) => 
    first === undefined
      ? counter
      : lengthTCO(rest, 1 + counter);

  const callLast = (fn, ...args) =>
    (...moarArgs) =>
      fn(...moarArgs, ...args);

  const length = callLast(lengthTCO, 0);

  console.log(length(['how', 'now', 'brown', 'cow']));

#+END_SRC

#+RESULTS:
: 4
: undefined

**** Factorial Example

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"


  const factorialTCO = (num, product) => 
    num === 1
      ? product
      : factorialTCO(num - 1, num * product);

  const callLast = (fn, ...args) =>
    (...moarArgs) =>
      fn(...moarArgs, ...args);

  const factorial = callLast(factorialTCO, 1);

  console.log(factorial(5));

#+END_SRC

#+RESULTS:
: 120
: undefined

**** Example:
     
#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const factorial = (n, work = 1) =>
    n === 1
      ? work
      : factorial(n - 1, n * work)

  console.log(factorial(5));

#+END_SRC

#+RESULTS:
: 120

**** Length and mapWith Examples:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const length = ([first, ...rest], numberToBeAdded = 0) =>
    first === undefined
      ? numberToBeAdded
      : length(rest, 1 + numberToBeAdded)
 
  console.log(length(["foo", "bar", "baz"]));

  const mapWith = (fn, [first, ...rest], prepend = []) =>
    first === undefined
      ? prepend
      : mapWith(fn, rest, [...prepend, fn(first)]);

  console.log(mapWith((x) => x * x, [1, 2, 3, 4, 5]));

#+END_SRC

#+RESULTS:
: 3
: [ 1, 4, 9, 16, 25 ]

**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const [first, second = "two"] = ["one"];
  console.log(`${first} . ${second}`);

  const [third, fourth = "two"] = ["primus", "secundus"]; 
  console.log(`${third} . ${fourth}`);

#+END_SRC

#+RESULTS:
: one . two
: primus . secundus


*** Three different ways to store functions:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const combinator = {
    idiotBird : function (x) {
      return x;
    },
    kestrel : function kestrel (x) {
      return (y) => (x);
    },
    blackBird (a, b) {
     return (c) => a(b(c));
    }
  }

  var bigBird = combinator.blackBird(combinator.kestrel, combinator.idiotBird)(3);

  console.log(bigBird());

#+END_SRC

#+RESULTS:
: 3
: undefined

**** Literal Destructuring:
     
#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const knight = {
    name: {
      first: 'Matthew',
      last: 'Hoselton'
    },
    quest: 'to seek the Y combinator',
    color: 'blue'
  }

  const {name: {first: given, last: surname}, quest, color} = user;

  console.log(given + ' ' + surname);

#+END_SRC

#+RESULTS:
: Matthew Hoselton
: undefined

**** Destructuring Parameters:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const knight = {
    name: {
      first: 'Matthew',
      last: 'Hoselton'
    },
    quest: 'to seek the Y combinator',
    color: 'blue'
  }

  const description = ({name: {first: given, last: surname}, quest, color}) =>
   `Sir ${surname} is on a quest ${quest}`

  console.log(description(knight));

#+END_SRC

#+RESULTS:
: Sir Hoselton is on a quest to seek the y combinator
: undefined

**** Sugar (for when the object key is a valid variable name):

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const knight = {
    name: {
      first: 'Matthew',
      last: 'Hoselton'
    },
    quest: 'to seek the Y combinator',
    color: 'blue'
  }

  const description = ({name: {first, last}, quest, color}) =>
   `Sir ${last} is on a quest ${quest}`

  console.log(description(knight));

#+END_SRC

#+RESULTS:
: Sir Hoselton is on a quest to seek the Y combinator
: undefined

**** Object Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = { first: 1, 
                        rest: { 
                          first: 2,
                          rest: { 
                            first: 3, 
                            rest: EMPTY  
                          }
                        }
                      };

  console.log(oneTwoThree.first);
  console.log(oneTwoThree.rest);

#+END_SRC

#+RESULTS:
: 1
: { first: 2, rest: { first: 3, rest: {} } }

**** Length Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = {first: 1, rest: {first: 2, rest: {first: 3, rest: EMPTY}}};

  const length = (node, counter = 0) =>
    node === EMPTY
      ? counter
      : length(node.rest, counter + 1)

  console.log(length(oneTwoThree));

#+END_SRC

#+RESULTS:
: 3

**** Slow Copy Example:
     
#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = {first: 1, rest: {first: 2, rest: {first: 3, rest: EMPTY}}};

  const slowcopy = (node) => 
    node === EMPTY
      ? EMPTY
      : { first: node.first, rest: slowcopy(node.rest)};

  console.log(slowcopy(oneTwoThree));

#+END_SRC

#+RESULTS:
: { first: 1, rest: { first: 2, rest: { first: 3, rest: {} } } }

**** Reverse Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = {first: 1, rest: {first: 2, rest: {first: 3, rest: EMPTY}}};

  const reverse = (node, delayed = EMPTY) => 
    node === EMPTY
      ? delayed
      : reverse(node.rest, {first: node.first, rest: delayed});

  console.log(reverse(oneTwoThree));

#+END_SRC

#+RESULTS:
: { first: 3, rest: { first: 2, rest: { first: 1, rest: {} } } }

**** reverseMap Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = {first: 1, rest: {first: 2, rest: {first: 3, rest: EMPTY}}};

  const reverseMap = (fn, node, delayed = EMPTY) => 
    node === EMPTY
      ? delayed
      : reverseMap(fn, node.rest, {first: fn(node.first), rest: delayed});

  console.log(reverseMap((x) => x * x, oneTwoThree));

#+END_SRC

#+RESULTS:
: { first: 9, rest: { first: 4, rest: { first: 1, rest: {} } } }

**** Map Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = {first: 1, rest: {first: 2, rest: {first: 3, rest: EMPTY}}};

  const reverse = (node, delayed = EMPTY) => 
    node === EMPTY
      ? delayed
      : reverse(node.rest, {first: node.first, rest: delayed});

  const map = (fn, node, delayed = EMPTY) => 
    node === EMPTY
      ? reverse(delayed)
      : map(fn, node.rest, {first: fn(node.first), rest: delayed});

  console.log(map((x) => x * x, oneTwoThree));

#+END_SRC

#+RESULTS:
: { first: 1, rest: { first: 4, rest: { first: 9, rest: {} } } }

*** Mutation Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const allHallowsEve = [2012, 10, 31];
  (function (halloween) {
    halloween[0] = 2013;
  })(allHallowsEve);

  console.log(allHallowsEve);

#+END_SRC

#+RESULTS:
| 2013 | 10 | 31 |

*** moar simple mutation example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const allHallowsEve = [2012, 10, 31];
  const halloween = allHallowsEve;
  halloween[0] = 2013;
  console.log(allHallowsEve);

#+END_SRC

#+RESULTS:
| 2013 | 10 | 31 |

**** Map Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

const EMPTY = {};
const OneToFive = {first: 1,
                   rest: {
                     first: 2,
                     rest: {
                       first: 3,
                       rest: {
                         first: 4,
                         rest: {
                           first: 5,
                           rest: EMPTY }}}}};

  const mapWith = (fn, node, head = null, tail = null) => {
    if (node === EMPTY) {
      return head; 
    } else if (tail === null) {
      const { first, rest } = node;
      const newNode = { first: fn(first), rest };
      return mapWith(fn, rest, newNode, newNode);
    } else {
      const { first, rest } = node;
      const newNode = { first: fn(first), rest };
      tail.rest = newNode;
      return mapWith(fn, node.rest, head, newNode);
    }
  }

console.log(mapWith((x) => 1.0 / x, OneToFive));

#+END_SRC

#+RESULTS:
: { first: 1,
:   rest: 
:    { first: 0.5,
:      rest: { first: 0.3333333333333333, rest: [Object] } } }
: undefined


**** Array Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const parentArray = [1, 2, 3];
  const [aFirst, ...childArray] = parentArray;

  parentArray[2] = "three";
  childArray[0] = "two";
 
  console.log(parentArray);
  console.log(childArray);
  
#+END_SRC

#+RESULTS:
: [ 1, 2, 'three' ]
: [ 'two', 3 ]

**** Linked List Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const EMPTY = { first: {}, rest: {} };
  const parentList = { first: 1, rest: { first: 2, rest: { first: 3, rest: EMPTY }}};
  const childList = parentList.rest;

  parentList.rest.rest.first = "three";
  childList.first = "two";
  
  console.log(parentList);
  console.log(childList);
  
#+END_SRC

#+RESULTS:
: { first: 1,
:   rest: { first: 'two', rest: { first: 'three', rest: [Object] } } }
: { first: 'two',
:   rest: { first: 'three', rest: { first: {}, rest: {} } } }

*** A few utilities for linked lists:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const copy = (node, head = null, tail = null) => { 
    if (node === EMPTY) {
      return head;
    } else if (tail === null) {
      const { first, rest } = node;
      const newNode = { first, rest };
      return copy(rest, newNode, newNode);
    } else {
      const { first, rest } = node;
      const newNode = { first, rest };
      tail.rest = newNode;
      return copy(node.rest, head, newNode);
    }
  }

  const first = ({first, rest}) => first;
  const rest = ({first, rest}) => rest;
  const EMPTY = {first: {}, rest: {}};
  
  const reverse = (node, delayed = EMPTY) => 
    node === EMPTY
      ? delayed
      : reverse(rest(node), { first: first(node), rest: delayed });

  const mapWith = (fn, node, delayed = EMPTY) =>
    node === EMPTY
      ? reverse(delayed)
      : mapWith(fn, rest(node), { first: fn(first(node)), rest: delayed });

  const at = (index, list) =>
    index === 0
      ? first(list)
      : at(index - 1, rest(list));

  const set = (index, value, list, originalList = list) =>
    index === 0
      ? (list.first = value, originalList)
      : set(index - 1, value, rest(list), originalList)
 
  const parentList = { first: 1, rest: { first: 2, rest: { first: 3, rest: EMPTY }}};
  const childList = rest(parentList);

  set(2, "three", parentList);
  set(0, "two", childList);

  console.log(parentList);
  console.log(childList);

#+END_SRC

#+RESULTS:
: { first: 1,
:   rest: { first: 'two', rest: { first: 'three', rest: [Object] } } }
: { first: 'two',
:   rest: { first: 'three', rest: { first: {}, rest: {} } } }

*** TODO Copy-on-read (code example doesn't reflect book, or scope of section)
    One strategy to avoid unwanted side-effects when mutating a linked list's node
    is to make a copy whenever we take the rest of a list.

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const copy = (node, head = null, tail = null) => { 
    if (node === EMPTY) {
      return head;
    } else if (tail === null) {
      const { first, rest } = node;
      const newNode = { first, rest };
      return copy(rest, newNode, newNode);
    } else {
      const { first, rest } = node;
      const newNode = { first, rest };
      tail.rest = newNode;
      return copy(node.rest, head, newNode);
    }
  }

  const first = ({first, rest}) => first;
  const EMPTY = {first: {}, rest: {}};
  
  const reverse = (node, delayed = EMPTY) => 
    node === EMPTY
      ? delayed
      : reverse(rest(node), { first: first(node), rest: delayed });

  const mapWith = (fn, node, delayed = EMPTY) =>
    node === EMPTY
      ? reverse(delayed)
      : mapWith(fn, rest(node), { first: fn(first(node)), rest: delayed });

  const at = (index, list) =>
    index === 0
      ? first(list)
      : at(index - 1, rest(list));

  const set = (index, value, list, originalList = list) =>
    index === 0
      ? (list.first = value, originalList)
      : set(index - 1, value, rest(list), originalList)
 
  const rest = ({first, rest}) => copy(rest);

  const parentList = { first: 1, rest: { first: 2, rest: { first: 3, rest: EMPTY }}};
  const childList = rest(parentList);

  const newParentList = set(2, "three", parentList);
  set(0, "two", childList);

  console.log(parentList);
  console.log(newParentList);
  console.log(childList);

#+END_SRC

#+RESULTS:
: { first: 1,
:   rest: { first: 2, rest: { first: 3, rest: [Object] } } }
: { first: 1,
:   rest: { first: 2, rest: { first: 3, rest: [Object] } } }
: { first: 'two',
:   rest: { first: 3, rest: { first: {}, rest: {} } } }

      This strategy is called "copy-on-read" because when we attempt to access the
    rest of a list, we automatically make a copy, in anticipation of subsequent
    mutation, to ensure that those mutations don't affect the parent list. 
      But, while effective at avoiding mutations to the parent, this technique is
    a costly prophylactic measure to take everytime we want the rest of a list.

*** Copy-on-write
    Instead of calling copy each time we take the rest of a list, we could only
    copy when we call set - until we are going to mutate state.

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output


  const rest = ({first, rest}) => rest;

  const EMPTY = {first: {}, rest: {}};

  const set = (index, value, list) =>
    index === 0
      ? { first: value, rest: list.rest }
      : { first: list.first, rest: set(index - 1, value, list.rest) };

  const parentList = { first: 1, rest: { first: 2, rest: { first: 3, rest: EMPTY }}};
  const childList = rest(parentList);

  const newParentList = set(2, "three", parentList);
  const newChildList = set(0, "two", childList);

  console.log(parentList);
  console.log(childList);

  console.log(newParentList);
  console.log(newChildList);

#+END_SRC

#+RESULTS:
: { first: 1,
:   rest: { first: 2, rest: { first: 3, rest: [Object] } } }
: { first: 2, rest: { first: 3, rest: { first: {}, rest: {} } } }
: { first: 1,
:   rest: { first: 2, rest: { first: 'three', rest: [Object] } } }
: { first: 'two',
:   rest: { first: 3, rest: { first: {}, rest: {} } } }

*** callLeft, foldArrayWith, and arraySum Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const callLeft = (fn, ...args) =>
    (...remainingArgs) =>
      fn(...args, ...remainingArgs);

  const foldArrayWith = (fn, terminalValue, [first, ...rest]) =>
    first === undefined
      ? terminalValue
      : fn(first, foldArrayWith(fn, terminalValue, rest));

  const arraySum = callLeft(foldArrayWith, (a, b) => a + b, 0);
  
  console.log(arraySum([1, 4, 9, 16, 25]));

#+END_SRC

#+RESULTS:
: 55

**** Second, implement a fold that works on tree structures

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const callRight = (fn, ...args) =>
    (...remainingArgs) =>
      fn(...remainingArgs, ...args);

  const foldTreeWith = (fn, terminalValue, [first, ...rest]) =>
    first === undefined
      ? terminalValue
      : Array.isArray(first)
        ? fn(foldTreeWith(fn, terminalValue, first),
                          foldTreeWith(fn, terminalValue, rest))
        : fn(first, foldTreeWith(fn, terminalValue, rest));

  const foldTree = (tree) => callRight(foldTreeWith, tree);
  
  const sumFoldable = (folder) => folder((a, b) => a + b, 0);

 console.log(sumFoldable(foldTree([1, [4, [9, 16]], 25])));

#+END_SRC

#+RESULTS:
: 55
      
**** while Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const arraySum = (array) => {
    let done;
    let sum = 0;
    let i = 0;
  
    while ((done = i == array.length, !done)) {
      const value = array[i++];
      sum += value;
    }

    return sum
  }
 
  console.log(arraySum([1, 4, 9, 16, 25]));

#+END_SRC

#+RESULTS:
: 55
: undefined

**** TODO we can represent out state with a pojo (err obj not declar in text):

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const arraySum = (array) => {
    let done;
    let sum = 0;
    let index = 0;
    let eachIteration = {};

    while ((eachIteration = { 
              done: index === array.length,
              value: index < array.length ? array[index] : undefined },
            ++index,
            !eachIteration.done)) {
              sum += eachIteration.value;
    }

    return sum;
  }

  console.log(arraySum([1, 4, 9, 16, 25]));

#+END_SRC

#+RESULTS:
: 55

**** we can extract the state keeping bits into an iterator function:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"
  const arrayIterator = (array) => {
    let i = 0;
    return () => {
      const done = i === array.length;
      return { done,
               value: done ? undefined : array[i++] }
    }
  }

  const iteratorSum = (iterator) => {
    let eachIteration, sum = 0;

    while ((eachIteration = iterator(), !eachIteration.done)) {
      sum += eachIteration.value;
    }

    return sum;  
  }

console.log(iteratorSum(arrayIterator([1, 4, 9, 16, 25])));

#+END_SRC

#+RESULTS:
: 55
: undefined

**** now iterators with lists
     
#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const EMPTY = null;
  
  const isEmpty = (node) =>
    node === EMPTY;

  const pair = (first, rest = EMPTY) =>
    ({first, rest});

  const list = (...elements) =>{
    const [first, ...rest] = elements;
    return elements.length === 0
      ? EMPTY
      : pair(first, list(...rest))
  }

  const print = (aPair) =>
    isEmpty(aPair)
      ? ""
      : `${aPair.first} ${print(aPair.rest)}`

  const listIterator = (aPair) =>
    () => {
      const done = isEmpty(aPair);
      if (done) {
        return {done};
      } else {
        const {first, rest} = aPair;
        aPair = aPair.rest;
        return { done, value: first }
      }
    }

  const iteratorSum = (iterator) => {
    let eachIteration;
    let sum = 0;
    
    while ((eachIteration = iterator(), !eachIteration.done)) {
      sum += eachIteration.value;
    }
    
    return sum
  }

  const aListIterator = listIterator(list(1, 4, 9, 16, 25)); 

  console.log(iteratorSum(aListIterator));

#+END_SRC

#+RESULTS:
: 55
: undefined

**** FibonacciIterator Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

const fibIter = () => {
  let previous = 0;
  let current = 1;

  return () => {
    
    let value = previous;
    previous = current;
    current = value + previous;

    return {done: false, value}
  }

}

const infinifib = fibIter();

console.log(infinifib().value);
console.log(infinifib().value);
console.log(infinifib().value);
console.log(infinifib().value);
console.log(infinifib().value);
console.log(infinifib().value);
console.log(infinifib().value);
console.log(infinifib().value);

#+END_SRC

#+RESULTS:
: 0
: 1
: 1
: 2
: 3
: 5
: 8
: 13
**** Mapping an iterator Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const NumberIterator = (number = 0) =>
    () =>
      ({ done: false, value: number++ })

  const mapIteratorWith = (fn, iterator) => 
    () => {
      const {done, value} = iterator();
        return ({done, value: done ? undefined : fn(value)});
    }

  const squares = mapIteratorWith((x) => x * x, NumberIterator(1));

  console.log( squares().value);
  console.log( squares().value);
  console.log( squares().value);
  console.log( squares().value);

#+END_SRC

#+RESULTS:
: 1
: 4
: 9
: 16

**** take example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" results: output

const fibIter = () => {
  let previous = 0;
  let current = 1;

  return () => {
    
    let value = previous;
    previous = current;
    current = value + previous;

    return {done: false, value}
  }
}

  const take = (iterator, numberToTake) => {
    let count = 0;
    return () => {
      if (++count <= numberToTake) {
        return iterator();
      } else {
        return {done: true};
      }
    };
  };

  const toArray = (iterator) => {
    let eachIteration;
    let array = [];
    while ((eachIteration = iterator(), !eachIteration.done)) {
      array.push(eachIteration.value);
    }
    return array;
  }

  console.log(toArray(take(fibIter(), 5)));

#+END_SRC

#+RESULTS:
| 0 | 1 | 1 | 2 | 3 |

**** The kestrel

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

 const K = (x) => (y) => x;

 const fortyTwo = K(42);

 console.log(fortyTwo(6));

#+END_SRC

#+RESULTS:
: 42
: undefined

**** The idiot bird

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

 const I = (x) => x;

 const fortyTwo = I(42);

 console.log(fortyTwo);


#+END_SRC

#+RESULTS:
: 42
: undefined

**** K(I)
     Given two values, we can say that K always returns the first value.
     If the first value is I, then K(I) will always return the second value.

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const K = (x) => (y) => x;
  const I = (x) => x;

  const first = K;
  const second = K(I);

  console.log(first("primus")("secundus"));
  console.log(second("primus")("secundus"));

#+END_SRC

#+RESULTS:
: primus
: secundus

*** ignorance and backwardness
    Our K(I) example marks a different approach to functions that access data. We
    are used to functions knowing about the data they access (for example a
    function that destructures its arguments must know whether the arguments are
    arrays or objects.
      But the first and second we built out of K and I do not attempt to know about
    their data, they just faithfully return it in the same form it was provided. In
    order to use them with a two-element array, we'd need to have a piece of code
    that calls some code.
      We can create an intermediary function that delays the application of
    arguments to our first and second selector functions. This creates a data
    structure that is itself a function. Instead of passing our data to K or K(I),
    we can pass K or K(I) to our data structure function. This is exactly backwards
    of the way we write functions that operate on data.

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const K = (x) => (y) => x;
  const I = (x) => x;

  const first = K;
  const second = K(I);

  const latin = (selector) => selector("primus")("secundus");

  console.log(latin(first));
  console.log(latin(second));

#+END_SRC

#+RESULTS:
: primus
: secundus

*** the vireo
    Now that we have represented our data structure  as a function that accepts a
    selector and returns data, we can create a function that returns data
    structures.
      Our data structure is the function:
        (selector) => selector("primus")("secundus")
    To create such a data structure, we need to extract the data into parameters:
        (first, second) => (selector) => selector(first)(second)
    We can also curry the above so that each combinator only recieves one parameter
        (first) => (second) => (selector) => selector(first)(second)
    This is the V combinator, the vireo!
        (x) => (y) => (z) => z(x)(y)
    Armed with nothing more than K, I, and V, we can make a data structure that
    holds two values, the cons cell of LISP and the node of a linked list.

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const K = (x) => (y) => x;
  const I = (x) => x;
  const V = (x) => (y) => (z) => z(x)(y);

  const first = K;
  const second = K(I);
  const pair = V;

  const latin = pair("primus")("secundus");
  
  console.log(latin(first));
  console.log(latin(second));

#+END_SRC

#+RESULTS:
: primus
: secundus

*** lists with functions as data
    We can use pure functions to represent a linked list. In fact, anything that
    can be computed can be computed using functions and nothing else.

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const K = (x) => (y) => x;
  const I = (x) => x;
  const V = (x) => (y) => (z) => z(x)(y);
  const EMPTY = (() => {});

  const first = K;
  const rest = K(I);
  const pair = V;
  
  const l123 = pair(1)(pair(2)(pair(3)(EMPTY)));

  const length = (aPair) =>
    aPair === EMPTY
      ? 0
      : 1 + length(aPair(rest));

  const reverse = (aPair, delayed = EMPTY) =>
    aPair === EMPTY
      ? delayed
      : reverse(aPair(rest), pair(aPair(first))(delayed));

  const mapWith = (fn, aPair, delayed = EMPTY) =>
    aPair === EMPTY
      ? reverse(delayed)
      : mapWith(fn, aPair(rest), pair(fn(aPair(first)))(delayed));

  const doubled = mapWith((x) => x * 2, l123)

  console.log(l123(first), l123(rest)(first), (l123(rest)(rest)(first)));

  console.log(length(l123));

  console.log(doubled(first), doubled(rest)(first), doubled(rest)(rest)(first));

#+END_SRC

#+RESULTS:
: 1 2 3
: 3
: 2 4 6

**** length and print with function based ternary Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const K = (x) => (y) => x;
  const I = (x) => x;
  const V = (x) => (y) => (z) => z(x)(y);

  const pairFirst = K;
  const pairRest = K(I);
  const pair = V;
 
  const first = (list) => 
    list(
      () => "ERROR: Can't take first of an empty list",
      (aPair) => aPair(pairFirst)
    );

  const rest  = (list) => 
    list(
      () => "ERROR: Can't take first of an empty list",
      (aPair) => aPair(pairRest)
    );

  const length = (list) => 
    list(
      () => 0,
      (aPair) => 1 + length(aPair(pairRest))
    );
  
  const print = (list) =>
    list(
      () => "EMPTYLIST",
      (aPair) => `${aPair(pairFirst)} ${print(aPair(pairRest))}`
    );

  const EMPTYLIST = (whenEmpty, unlessEmpty) => whenEmpty();

  const node = (x) =>
    (y) =>
      (whenEmpty, unlessEmpty) =>
        unlessEmpty(pair(x)(y));

  const l123 = node(1)(node(2)(node(3)(EMPTYLIST)));

  console.log(print(l123));
  console.log(length(l123));

#+END_SRC

#+RESULTS:
: 1 2 3 EMPTYLIST
: 3

**** reverse and map with function based ternary Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const K = (x) => (y) => x;
  const I = (x) => x;
  const V = (x) => (y) => (z) => z(x)(y);

  const pairFirst = K;
  const pairRest = K(I);
  const pair = V;
 
  const first = (list) => 
    list(() => "ERROR: Can't take first of an empty list",
         (aPair) => aPair(pairFirst));

  const rest  = (list) => 
    list(() => "ERROR: Can't take first of an empty list",
         (aPair) => aPair(pairRest));
  
  const print = (list) =>
    list(() => "EMPTYLIST",
         (aPair) => `${aPair(pairFirst)} ${print(aPair(pairRest))}`);

  const EMPTYLIST = (whenEmpty, unlessEmpty) => whenEmpty();

  const node = (x) =>
    (y) =>
      (whenEmpty, unlessEmpty) =>
        unlessEmpty(pair(x)(y));

  const l123 = node(1)(node(2)(node(3)(EMPTYLIST)));

  const reverse = (list, delayed = EMPTYLIST) => 
    list(() => delayed, (aPair) =>
      reverse(aPair(pairRest), node(aPair(pairFirst))(delayed)));

  const mapWith = (fn, list, delayed = EMPTYLIST) =>
    list(() => reverse(delayed),
         (aPair) => mapWith(fn, aPair(pairRest),
                    node(fn(aPair(pairFirst)))(delayed)));

  console.log(print(reverse(l123)));
  console.log(print(mapWith(x => x * x, reverse(l123))));

#+END_SRC

#+RESULTS:
: 3 2 1 EMPTYLIST
: 9 4 1 EMPTYLIST

** mapWith
   mapWith differs from the native JavaScript .map array method by reversing the 
   arguments - putting the function first, and then curring the function. Note
   that we could do the same thing with callRight.

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const mapWith = (fn) => 
    (list) => list.map(fn);

  const squaresOf = mapWith(n => n * n); 

  console.log(squaresOf([1, 2, 3, 4, 5]));

#+END_SRC

#+RESULTS:
: [ 1, 4, 9, 16, 25 ]

*** Object.assign Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const inventory = { apples: 12, oranges: 12};
  const inventoryCopy = Object.assign({}, inventory);

  console.log(inventoryCopy);
  
  const shipment = {bananas: 54, pears: 24};
  Object.assign(inventory, shipment);

  console.log(inventory);
  console.log(inventoryCopy);

#+END_SRC

#+RESULTS:
: { apples: 12, oranges: 12 }
: { apples: 12, oranges: 12, bananas: 54, pears: 24 }
: { apples: 12, oranges: 12 }

** Why?
  
 The Y combinator:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const Y = (f) =>
  ( x => f(v => x(x)(v)) )
  ( x => f(v => x(x)(v)) );

  const factorial = Y(function (fac) { 
    return function (n) {
      return (n == 0 ? 1 : n * fac(n - 1)); }
    });

  console.log(factorial(5));

#+END_SRC

#+RESULTS:
: 120

  Here's my guide to the y-combinator!

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  // First I present the Y combinator:

  const Y = (f) =>
  ( x => f(v => x(x)(v)) )
  ( x => f(v => x(x)(v)) );

  // Next, a function to pass to the Y combinator
  // It's nothing fancy, just a function to compute factorials
  // It's interesting to note that it returns a function
  // that returns a ternary expression, reminiscent of linear recursion

  const factorial = Y(function (fac) { 
    return function (n) {
      return (n == 0 ? 1 : n * fac(n - 1)); }
    });

  // 

  factorial(5);

  // Let the substitution begin!
  // First I'll substitute function where its called.

  (Y(function (fac) {
    return function (n) {
      return (n == 0 ? 1 : n * fac(n - 1)); }
    }))(5)

  // Now, to substitute in the Y combinator
  
  (((f) =>
    ( x => f(v => x(x)(v)) )
    ( x => f(v => x(x)(v)) ))
   (function (fac) {
    return function (n) {
      return (n == 0 ? 1 : n * fac(n - 1)); }
    }))(5)

 // My, my, my, my, my. what a mess
 // lets apply our function to the combinator
 // and see if we can't clean this up

  (( x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })
   ( x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); }))(5)
   
 // Well, it does look more orderly. But I fear we'll just make a mess of it again.
 // Now to apply the inner functions to each other.
 // Hopefully this will return a function to which we can apply 5...

  (n => { 
    return (
      n == 0
        ? 1 
        : n * (v => (x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })
                    (x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })(v)
              )(n - 1)
    ); 
  })(5)

  // Ok, I just ran the above and got the same answer.
  // So, I'm going to proceed as if I haven't make any substitution errors.
  // Let's begin to evaluate our function!
  // First, we pass 5 to our function, binding 5 to n
  // n !== 0 so we're left with


  (5 * (v => (x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })
             (x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })(v)
       )(4));

  // AKA

  (5 * ((x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })
        (x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })(4)));

  // Can you see where this is going?
  // If the ternary embedded in the function didn't tip you off...
  // This should definitely smell like linear recursion at this point!
  // We've got a starting value that looks like it's the beginning of a deffered computation;
  // And we're about to apply its decrement to a function that looks suspiciously similar to 
  // the Y combinator that we started with.

  // Enough talking. Substitute!
 
  (5 * (n => {
         return (
           n == 0
             ? 1
             : n * (v => (x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })
                         (x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })
                         (v)
                   )(n - 1)
         );
       })(4));

  // 4 !== 0
  // Again! Again!

  (5 * 4 * (v => (x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })
                 (x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })(v)
           )(3));

  // Simpler! Simpler!

  (5 * 4 * ((x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })
            (x => n => { return (n == 0 ? 1 : n * (v => x(x)(v))(n - 1)); })(3)));

  // Whew! That's tiring. I'm going to stop here. I think we all get the idea...
  // So what's going on, there seems to be dinstinct behavior for three pieces
  // First, X has no interaction with our factorial function. 
  // Second, V serves as a means to pass the decrement of the original input to
  // the next recursion. In this way it balances n => in our factorial function
  // Third, the factorial function 


#+END_SRC


**** Stack via IIFE Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

const stack = (() => {
  const obj = {
    array: [],
    index: -1,
    push (value) {
      return obj.array[obj.index += 1] = value
    },
    pop () {
      const value = obj.array[obj.index];
      obj.array[obj.index] = undefined;
      if (obj.index >= 0) {
        obj.index -= 1
      }
    return value
    },
    isEmpty () {
      return obj.index < 0
    }
  };
  return obj;
})();

console.log(stack.isEmpty());
console.log(stack.push('hello'));
console.log(stack.push('JavaScript'));
console.log(stack.isEmpty());
console.log(stack.pop());
console.log(stack.pop());
console.log(stack.isEmpty());

#+END_SRC

#+RESULTS:
: true
: hello
: JavaScript
: false
: JavaScript
: hello
: true
       
**** Stack via IIFE w/ encapsulation Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

const stack = (() => {
  const array = [];
  let index = -1;
  const obj = {
    push (value) {
      return array[index += 1] = value
    },
    pop () {
      const value = array[index];
      array[index] = undefined;
      if (index >= 0) {
        index -= 1
      }
    return value
    },
    isEmpty () {
      return index < 0
    }
  };
  return obj;
})();

console.log(stack.isEmpty());
console.log(stack.push('hello'));
console.log(stack.push('JavaScript'));
console.log(stack.isEmpty());
console.log(stack.pop());
console.log(stack.pop());
console.log(stack.isEmpty());

#+END_SRC

#+RESULTS:
: true
: hello
: JavaScript
: false
: JavaScript
: hello
: true

**** Stack Maker Function Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

const Stack = () => {
  const array = [];
  let index = -1;
  return {
    push (value) {
      return array[index += 1] = value
    },
    pop () {
      const value = array[index];
      array[index] = undefined;
      if (index >= 0) {
        index -= 1
      }
    return value
    },
    isEmpty () {
      return index < 0
    }
  };
};

const stack = Stack();
console.log(stack.isEmpty());
console.log(stack.push('hello'));
console.log(stack.push('JavaScript'));
console.log(stack.isEmpty());
console.log(stack.pop());
console.log(stack.pop());
console.log(stack.isEmpty());

#+END_SRC

#+RESULTS:
: true
: hello
: JavaScript
: false
: JavaScript
: hello
: true

**** Model w/ undo/redo stacks Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const shallowCopy = (source) => {
    const dest = {};
    for (let key in source) {
      dest[key] = source[key]
    }
    return dest
  };

  const Stack = () => {
    const array = [];
    let index = -1;

    return {
      push (value) {
        array[index += 1] = value
      },
      pop () {
        let value = array[index];
        if (index >= 0) {
          index -= 1
        }
        return value
      },
      isEmpty () { return index < 0}
    }
};


  const Model = function (initialAttributes) {
    let attributes = shallowCopy(initialAttributes || {});
    const redoStack = Stack();
    const undoStack = Stack();
    const obj = {
      set: (attrsToSet) => {
        undoStack.push(shallowCopy(attributes));
        if (!redoStack.isEmpty()) {
            redoStack.length = 0;
        }
        for (let key in (attrsToSet || {})) {
          attributes[key] = attrsToSet[key]
        }
        return obj
      },
      undo: () => {
        if (!undoStack.isEmpty()) {
          redoStack.push(shallowCopy(attributes));
          attributes = undoStack.pop()
        }
        return obj
      },
      redo: () => {
        if (!redoStack.isEmpty()) {
          undoStack.push(shallowCopy(attributes));
          attributes = redoStack.pop()
        }
        return obj
      },
      get: (key) => attributes[key],
      has: (key) => attributes.hasOwnProperty(key),
      attributes: () => shallowCopy(attributes)
    };
    return obj
  };

  const model = Model();
  model.set({"Doctor": "de Grasse"});
  model.set({"Doctor": "Who"});
  model.undo();
  console.log(model.get("Doctor"));
  model.redo();
  console.log(model.get("Doctor"));

#+END_SRC

#+RESULTS:
: de Grasse
: Who

**** Encapsulated Queue Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const Queue = () => {
    let array = [];
    let head = 0;
    let tail = -1;
    return {
      pushTail: (value) => array[++tail] = value,
      pullHead: () => {
        if (tail >= head) {
          const value = array[head];
          array[head] = undefined;
          ++head;
          return value
        }
      },
      isEmpty: () => tail < head
    }
  };

  const queue = Queue();
  queue.pushTail("Hello");
  queue.pushTail("JavaScript");
  queue.pushTail("Allonge");
  console.log(queue.pullHead());
  console.log(queue.pullHead());

#+END_SRC

#+RESULTS:
: Hello
: JavaScript

**** De-Encapsulated Queue Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const Queue = function () {
    const queue = {
      array : [],
      head : 0,
      tail : -1,
      pushTail: (value) => queue.array[++queue.tail] = value,
      pullHead: () => {
        if (queue.tail >= queue.head) {
          const value = queue.array[queue.head];
          queue.array[queue.head] = undefined;
          ++queue.head;
          return value
        }
      },
      isEmpty: () => queue.tail < queue.head
    }
    return queue;
  };

  const queue = Queue();
  queue.pushTail("Hello");
  queue.pushTail("JavaScript");
  queue.pushTail("Allonge");
  console.log(queue.pullHead());
  console.log(queue.pullHead());

#+END_SRC

#+RESULTS:
: Hello
: JavaScript

**** Extending a Queue to a Deque Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const Queue = function () {
    const queue = {
      array : [],
      head : 0,
      tail : -1,
      pushTail: (value) => queue.array[++queue.tail] = value,
      pullHead: () => {
        if (queue.tail >= queue.head) {
          const value = queue.array[queue.head];
          queue.array[queue.head] = undefined;
          ++queue.head;
          return value
        }
      },
      isEmpty: () => queue.tail < queue.head,
      expose: () => ({
        array: queue.array,
        head: queue.head,
        tail: queue.tail
      })
    }
    return queue;
  };

  const Dequeue = function () {
    const deque = Queue();
    let increment = 0;
    return Object.assign(deque, {
      size: () => deque.tail - deque.head + 1,
      pullTail: () => {
        if (!deque.isEmpty()) {
          const value = deque.array[deque.tail];
          deque.array[deque.tail] = undefined;
          deque.tail -= 1;
          return value;
        }
      },
      pushHead: (value) => {
        if (deque.head === 0) {
          increment = deque.tail - deque.head;
          for (let i = deque.tail; i >= deque.head; i--) {
            deque.array[i + increment] = deque.array[i];
          }
          deque.tail += increment;
          deque.head += increment;
        }
        return deque.array[deque.head -= 1] = value;
      }
    })
  };

  const dequeue = Dequeue();
  dequeue.pushTail("Hello");
  dequeue.pushTail("JavaScript");
  dequeue.pushHead("Allonge");
  console.log(dequeue.pullTail());
  console.log(dequeue.pullHead());
  console.log(dequeue.pullTail());

#+END_SRC

#+RESULTS:
: JavaScript
: Allonge
: Hello

**** TODO (const in for loop) copyOfQueue Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" results: output

  const Queue = () => {
    const queue = {
      array: [],
      head: 0,
      tail: -1,
       pushTail (value) {
         return queue.array[++queue.tail] = value
       },
       pullHead () {
         if (queue.tail >= queue.head) {
           const value = queue.array[queue.head];
           queue.array[queue.head] = undefined;
           queue.head += 1;
           return value
         }
       },
       isEmpty () {
         return queue.tail < queue.head;
       }
     };
     return queue
   };

  const queue = Queue();
  queue.pushTail('Hello');
  queue.pushTail('JavaScript');
  const copyOfQueue = Object.assign({}, queue);

  console.log(queue !== copyOfQueue);

  copyOfQueue.array = [];
  for (let i = 0; i < 2; ++i) {
    copyOfQueue.array[i] = queue.array[i]
  }

  console.log(queue.pullHead());
  console.log(copyOfQueue.pullHead());

#+END_SRC

#+RESULTS:
: true
: Hello
: JavaScript
: undefined

**** queueWithAmnesia Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" results: output

  const AmnesiacQueue = () => ({
    array: [],
    head: 0,
    tail: -1,
    pushTail (myself, value) {
      return myself.array[myself.tail += 1] = value
    },
    pullHead (myself) {
      if (myself.tail >= myself.head) {
        let value = myself.array[myself.head];
        myself.array[myself.head] = void 0;
        myself.head += 1;
        return value;
      }
    },
    isEmpty (myself) {
      return myself.tail < myself.head;
    }
  });

  const queueWithAmnesia = AmnesiacQueue();

  queueWithAmnesia.pushTail(queueWithAmnesia, 'Hello');
  queueWithAmnesia.pushTail(queueWithAmnesia, 'JavaScript');

  const queueWithAmnesiaToo = Object.assign({}, queueWithAmnesia);

  queueWithAmnesiaToo.array = [];
  for (let i = 0; i < 2; ++i) {
    queueWithAmnesiaToo.array[i] = queueWithAmnesia.array[i]
  }

  console.log(queueWithAmnesia.pullHead(queueWithAmnesia));
  console.log(queueWithAmnesia.pullHead(queueWithAmnesiaToo));

#+END_SRC

#+RESULTS:
: Hello
: Hello
: undefined

**** global -this- and shared method -this- Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const global = this;

  const someObject = { 
    someFunction () {
      return this;
    }
  };

  const someFunction = someObject.someFunction;
  console.log(someFunction() === someObject);
  console.log(someFunction() === global);

  const anotherObject = {
    someFunction: someObject.someFunction
  }
  console.log(anotherObject.someFunction() === anotherObject);
  console.log(anotherObject.someFunction() === someObject);

#+END_SRC

#+RESULTS:
: false
: true
: true
: false


#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const global = this;

  const someObject = { 
    someFunction () {
      return this;
    }
  };

  const someFunction = someObject.someFunction;
  console.log(someFunction() === someObject);
  console.log(someFunction() === global);

  const anotherObject = {
    someFunction: someObject.someFunction
  }
  console.log(anotherObject.someFunction() === anotherObject);
  console.log(anotherObject.someFunction() === someObject);

#+END_SRC

**** -call- shenanigans

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const a = [1,2,3], b = [4,5,6];
  console.log(a.concat([2,1]));
  console.log(a.concat.call(b,[2,1]));

#+END_SRC

#+RESULTS:
: [ 1, 2, 3, 2, 1 ]
: [ 4, 5, 6, 2, 1 ]

**** .call and .apply example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const array = [1,2,3,4,5];

  const third = function () { 
    return arguments[2]
  }

  console.log(third(...array));
  console.log(third.call(this, ...array));
  console.log(third.apply(this, array));

#+END_SRC

#+RESULTS:
: 3
: 3
: 3

**** TODO un-travesty 209

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const a = [1,2,3];
  const accrete = (x) => a.concat(x);
  console.log(accrete([4,5]));

#+END_SRC

#+RESULTS:
: [ 1, 2, 3, 4, 5 ]

**** contextualize Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const a = [1,2,3];

  const contextualize = (fn, context) => 
    (...args) =>
      fn.apply(context, args)

  const accrete2 = contextualize(a.concat, a);
  console.log(accrete2([4,5]));

#+END_SRC

#+RESULTS:
: [ 1, 2, 3, 4, 5 ]

**** contextualize and uncontextualize Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const contextualize = (fn, context) => 
    (...args) =>
      fn.apply(context, args)

  var aFourthObject = {};
  var returnThis = function () { return this; };

  aFourthObject.uncontextualized = returnThis;
  aFourthObject.contextualized = contextualize(returnThis, aFourthObject);
  
  console.log(aFourthObject.uncontextualized() === aFourthObject);
  console.log(aFourthObject.contextualized() === aFourthObject);

  // but

  var uncontextualized = aFourthObject.uncontextualized;
  var contextualized = aFourthObject.contextualized;
  console.log(uncontextualized() === aFourthObject);
  console.log(contextualized() === aFourthObject);

#+END_SRC

#+RESULTS:
: true
: true
: false
: true

*** DONE a-contextual function decorator Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const maybe = (fn) =>
    x => 
      x != null ? fn(x) : x;

const plus1 = x => x + 1;
  console.log(plus1(1));
  console.log(plus1(0));
  console.log(plus1(null));
  console.log(plus1(undefined));  // returns NaN not null

  const maybePlus1 = maybe(plus1);
  console.log(maybePlus1(1));
  console.log(maybePlus1(0));
  console.log(maybePlus1(null));
  console.log(maybePlus1(undefined));

#+END_SRC

#+RESULTS:
: 2
: 1
: 1
: NaN
: 2
: 1
: null
: undefined

*** method decorator Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const maybe = (fn) =>
    function (x) {
      return x != null ? fn.call(this, x) : x;
    };

  const someObject = {
    setSize: maybe(function (size) {
      this.size = size;
    })
  };

  someObject.setSize(5);
  console.log(someObject);

  someObject.setSize(null);
  console.log(someObject);

#+END_SRC

#+RESULTS:
: { setSize: [Function], size: 5 }
: { setSize: [Function], size: 5 }

*** recursive fibonacci:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const fibonacci = (n) =>
    n < 2
      ? n
      : fibonacci(n-2) + fibonacci(n-1);

  console.log([0,1,2,3,4,5,6,7,8].map(fibonacci));
  //console.log(fibonacci(45)); very slow

#+END_SRC

#+RESULTS:
: [ 0, 1, 1, 2, 3, 5, 8, 13, 21 ]
: 1134903170
  
*** DONE memo and fibonacci Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const memoized = (fn) => {
    const lookupTable = {};
    return function (...args) {
      const key = JSON.stringify.apply(this, args); //why this w/o apply in book?
      return lookupTable[key] || (lookupTable[key] = fn.apply(this, args));
    }
  }

  const fastFibonacci = memoized(
    (n) =>
      n < 2
        ? n
        : fastFibonacci(n-2) + fastFibonacci(n-1)
  );

  console.log(fastFibonacci(45));

#+END_SRC

#+RESULTS:
: 1134903170

**** broken memoFib (it's slow!) Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const memoized = (fn) => {
    const lookupTable = {};
    return function (...args) {
      const key = JSON.stringify.apply(this, args); //why this w/o apply in book?
      return lookupTable[key] || (lookupTable[key] = fn.apply(this, args));
    }
  }

  var fibonacci = memoized( function fibonacci (n) {
    if (n < 2) {
      return n
    } else {
      return fibonacci(n-2) + fibonacci(n-1)
    }
  });

  console.log(fibonacci(45)); //it's slow!

#+END_SRC

#+RESULTS:
: 1134903170

**** better memoFib (it's fast!) Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const memoized = (fn) => {
    const lookupTable = {};
    return function (...args) {
      const key = JSON.stringify.apply(this, args); //why this w/o apply in book?
      return lookupTable[key] || (lookupTable[key] = fn.apply(this, args));
    }
  }

  var fibonacci = memoized( function (n) {
    if (n < 2) {
      return n
    } else {
      return fibonacci(n-2) + fibonacci(n-1)
    }
  });

console.log(fibonacci(45)); // its fast!

#+END_SRC

#+RESULTS:
: 1134903170

*** simple getWith Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const getWith = (attr) => (object) => object[attr]

  const inventory = { apples: 0, oranges: 144, eggs: 36 };

  console.log(getWith('oranges')(inventory));

#+END_SRC

#+RESULTS:
: 144
: undefined

*** mapWith(getWith Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const getWith = (attr) => (object) => object[attr];

  const mapWith = (fn) => 
    (list) => list.map(fn);

  const inventories = [
{ apples: 0, oranges: 144, eggs: 36 }, { apples: 240, oranges: 54, eggs: 12 }, { apples: 24, oranges: 12, eggs: 42 }
];

  console.log(mapWith(getWith('oranges'))(inventories));

#+END_SRC

#+RESULTS:
: [ 144, null, 12 ]

*** mapWith(maybe(getWith Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const getWith = (attr) => (object) => object[attr];

  const mapWith = (fn) => 
    (list) => list.map(fn);

  const maybe = (fn) =>
    x => 
      x != null ? fn(x) : x;

  const inventories = [
{ apples: 0, oranges: 144, eggs: 36 }, { apples: 240, oranges: null, eggs: 12 }, { apples: 24, oranges: 12, eggs: 42 }
];

  console.log(mapWith(maybe(getWith('oranges')))(inventories));

#+END_SRC

#+RESULTS:
: [ 144, undefined, 12 ]

*** deepMapWith Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const report =
  [ [ { price: 1.99, id: 1 },
      { price: 4.99, id: 2 },
      { price: 7.99, id: 3 },
      { price: 1.99, id: 4 },
      { price: 2.99, id: 5 },
      { price: 6.99, id: 6 } ],
    [ { price: 5.99, id: 21 },
      { price: 1.99, id: 22 },
      { price: 1.99, id: 23 },
      { price: 1.99, id: 24 },
      { price: 5.99, id: 25 } ],
    [ { price: 7.99, id: 221 },
      { price: 4.99, id: 222 },
      { price: 7.99, id: 223 },
      { price: 10.99, id: 224 },
      { price: 9.99, id: 225 },
      { price: 9.99, id: 226 } ] ];

  const getWith = (attr) => (object) => object[attr];

  const deepMapWith = (fn) =>
    function innerdeepMapWith (tree) {
      return Array.prototype.map.call(tree, (element) =>
        Array.isArray(element)
          ? innerdeepMapWith(element)
          : fn(element)
      );
    };

  console.log(deepMapWith(getWith('price'))(report));

#+END_SRC

#+RESULTS:
: [ [ 1.99, 4.99, 7.99, 1.99, 2.99, 6.99 ],
:   [ 5.99, 1.99, 1.99, 1.99, 5.99 ],
:   [ 7.99, 4.99, 7.99, 10.99, 9.99, 9.99 ] ]


* Served by the Pot: Collections

t



#+BEGIN_SRC js :results output

var exec = require('child_process').exec;
console.log('Node Version ' + process.version);
console.log('Node Path: ' + process.env.NODE_PATH);
exec("org-babel-node --version", function (error, stdout, stderr) {
console.log('Babel Version: ' + stdout);
});

#+END_SRC

#+RESULTS:
: Node Version v4.1.1
: Node Path: /Users/fugalfunkster/code/org/node_modules:
: Babel Version: 6.7.5
: 

